#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_project_service.enable-services["monitoring.googleapis.com"]: Refreshing state... [id=gh-actions-321300/monitoring.googleapis.com]
google_project_service.enable-services["iam.googleapis.com"]: Refreshing state... [id=gh-actions-321300/iam.googleapis.com]
google_project_service.enable-services["container.googleapis.com"]: Refreshing state... [id=gh-actions-321300/container.googleapis.com]
google_compute_network.runner-vpc: Refreshing state... [id=projects/gh-actions-321300/global/networks/runner-vpc]
google_project_service.enable-services["secretmanager.googleapis.com"]: Refreshing state... [id=gh-actions-321300/secretmanager.googleapis.com]
google_project_service.enable-services["servicenetworking.googleapis.com"]: Refreshing state... [id=gh-actions-321300/servicenetworking.googleapis.com]
google_project_service.enable-services["serviceusage.googleapis.com"]: Refreshing state... [id=gh-actions-321300/serviceusage.googleapis.com]
google_project_service.enable-services["compute.googleapis.com"]: Refreshing state... [id=gh-actions-321300/compute.googleapis.com]
google_project_service.enable-services["cloudbuild.googleapis.com"]: Refreshing state... [id=gh-actions-321300/cloudbuild.googleapis.com]
google_project_service.enable-services["logging.googleapis.com"]: Refreshing state... [id=gh-actions-321300/logging.googleapis.com]
google_project_service.enable-services["storage-component.googleapis.com"]: Refreshing state... [id=gh-actions-321300/storage-component.googleapis.com]
google_project_service.enable-services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=gh-actions-321300/cloudresourcemanager.googleapis.com]
google_compute_subnetwork.runner-subnet: Refreshing state... [id=projects/gh-actions-321300/regions/us-west1/subnetworks/runner-subnet]
google_compute_instance.gce-runner: Refreshing state... [id=projects/gh-actions-321300/zones/us-west1-b/instances/gce-runner]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_instance.gce-runner must be replaced
-/+ resource "google_compute_instance" "gce-runner" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Broadwell" -> (known after apply)
      ~ current_status          = "RUNNING" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/gh-actions-321300/zones/us-west1-b/instances/gce-runner" -> (known after apply)
      ~ instance_id             = "1392579274189663241" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "f1-micro"
        metadata                = {
            "block-project-ssh-keys" = "true"
            "sshKeys"                = <<~EOT
                mitsuki.hiroe:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDHQIi1dR+GHaiY2zBas+X455CF/SL7PJiSyRp3cCL2t6AYPAq/XSMeLbYWYic9lz/jlI5enOuViniiZ05u8tpQTakGAetJb7X5x0AgesKxRT1tF/M5pRFpRy1Jb3jXL0GWTMWADkbHjk0nVB6uE4QnNpgHt35rcbMPUq/CuNK0TRWpmkEb4c4tlM637WqfZ6uw7nc+tssLua9NV27c+8oUPU//rd81o4cGLXoBZUgZ74V0oi0Qilf3xGfuci13YqmEg5nGJcw3Xv/eJrDG3Bl65jI+UzWPi7b2KljRs6Q2oSlww1JHFjQHZswzn4zVYYeLXZeBYA2blHT+0ssL8tql mitsuki.hiroe@O-07472-MAC.local
            EOT
        }
      ~ metadata_fingerprint    = "dYU3jL5dRAc=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
            ## init ubuntu
            sudo apt-get -y update
            sudo apt-get -y dist-upgrade
            sudo apt-get -y install unzip jq
            
            
            ## download
            
            # Create a folder
          - mkdir actions-runner && cd actions-runner 
          + mkdir ~/actions-runner && cd ~/actions-runner 
            # Download the latest runner package
            curl -o actions-runner-linux-x64-2.279.0.tar.gz -L https://github.com/actions/runner/releases/download/v2.279.0/actions-runner-linux-x64-2.279.0.tar.gz 
            # Optional: Validate the hash
            echo "50d21db4831afe4998332113b9facc3a31188f2d0c7ed258abf6a0b67674413a  actions-runner-linux-x64-2.279.0.tar.gz" | shasum -a 256 -c  
            # Extract the installer
            tar xzf ./actions-runner-linux-x64-2.279.0.tar.gz
            
            # run svc.sh manually
            
            # see below
            # https://github.com/mhiroe/gh-actions-repo/settings/actions/runners
            # https://qiita.com/sakas1231/items/567ea9bdc1d4ac9f8696
          + 
          + 
          + # svc.sh runs as daemon
          + # https://docs.github.com/ja/actions/hosting-your-own-runners/configuring-the-self-hosted-runner-application-as-a-service
          + # cant daemonize with "." user name
        EOT
      + min_cpu_platform        = (known after apply)
        name                    = "gce-runner"
      ~ project                 = "gh-actions-321300" -> (known after apply)
      - resource_policies       = [] -> null
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/gh-actions-321300/zones/us-west1-b/instances/gce-runner" -> (known after apply)
      - tags                    = [] -> null
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
        zone                    = "us-west1-b"

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/gh-actions-321300/zones/us-west1-b/disks/gce-runner" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20210720" -> "ubuntu-1804-bionic-v20210720"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/gh-actions-321300/global/networks/runner-vpc" -> "runner-vpc"
          ~ network_ip         = "192.168.10.2" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/gh-actions-321300/regions/us-west1/subnetworks/runner-subnet" -> "runner-subnet"
          ~ subnetwork_project = "gh-actions-321300" -> (known after apply)

          ~ access_config {
              ~ nat_ip       = "34.82.76.123" -> (known after apply)
              ~ network_tier = "PREMIUM" -> (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ min_node_cpus       = 0 -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

*Pusher: @mhiroe, Action: `pull_request`*